{
  "panel": {
    "empty_title": "Explicació del núvol de paraules",
    "empty_scope": "Selecciona un centre i, opcionalment, un ensenyament per veure el resum detallat.",
    "error_title": "No s'ha pogut actualitzar el resum",
    "error_scope": "Revisa la selecció i torna a provar."
  },
  "analysis_panel": {
    "title": "Com interpretar l'anàlisi del núvol",
    "paragraph_methods": "text2sdg combina dos enfocaments: sistemes de consulta (Aurora, Elsevier, Auckland, SIRIS, SDSN i SDGO) i models ensemble que integren tots els sistemes i la longitud del text.",
    "paragraph_tradeoff": "Segons la documentació de text2sdg, Aurora/Elsevier/Auckland/SIRIS acostumen a ser menys liberals que SDSN/SDGO. Les validacions comparatives encara són limitades, així que convé interpretar els resultats amb cautela.",
    "paragraph_sections": "La secció triada canvia el tipus de llenguatge analitzat: competències tendeix a termes transversals, informació de l'assignatura descriu millor el temari i referències reflecteix sobretot el marc bibliogràfic.",
    "paragraph_course_info": "Per reduir falsos positius, prova criteris més restrictius (intersecció de sistemes o seccions) i contrasta sempre amb la guia docent completa.",
    "paragraph_current": "",
    "aggregate_templates": {
      "centre": "Centre seleccionat: \"{centre}\" ({n_programmes} ensenyaments, {n_courses_centre} cursos).",
      "compare": "Comparativa activa: centre \"{centre}\" ({n_courses_centre} cursos) i ensenyament \"{programme}\" ({n_courses_programme} cursos).",
      "default": "La selecció activa inclou {n_courses_centre} cursos."
    },
    "system_templates": {
      "sys:any": "Amb \"{system_label}\", un ODS compta si apareix en qualsevol sistema. És la lectura més inclusiva i, alhora, la més sensible als falsos positius.",
      "sys:all": "Amb \"{system_label}\", només compten ODS que coincideixen a tots els sistemes. És més restrictiu: redueix falsos positius però pot perdre casos reals.",
      "sys:ensemble_equal": "Amb \"{system_label}\", s'aplica un model ensemble (random forest) que combina sis sistemes i longitud del text. Aquesta versió busca un balanç general entre cobertura i precisió.",
      "sys:ensemble_third": "Amb \"{system_label}\", s'aplica una versió ensemble amb proporció intermèdia de dades sintètiques d'entrenament. Ajusta el compromís sensibilitat/especificitat.",
      "sys:ensemble_triple": "Amb \"{system_label}\", s'aplica una versió ensemble amb més pes de dades sintètiques. Dona una lectura més prudent, però pot deixar fora casos límit.",
      "default": "Amb \"{system_label}\", {system_help} {system_quality}"
    },
    "section_templates": {
      "sec:any": "A la secció \"{section_label}\", es combinen competències, informació de l'assignatura i referències. Dona una visió global però pot barrejar contextos heterogenis.",
      "sec:all": "A la secció \"{section_label}\", només es mantenen termes que apareixen a tots els blocs. És un criteri més estricte i menys propens a falsos positius.",
      "sec:competences": "A la secció \"{section_label}\", el focus és competències i resultats; hi predominen termes transversals que poden repetir-se en moltes assignatures.",
      "sec:course_info": "A la secció \"{section_label}\", s'analitzen títol, descripció i continguts/temari. Sol ser la lectura més concreta del que realment es treballa a classe.",
      "sec:references": "A la secció \"{section_label}\", s'analitza bibliografia i referències. Pot introduir termes del context documental que no sempre són nucli docent de l'assignatura.",
      "default": "A la secció \"{section_label}\", {section_help}"
    },
    "feature_templates": {
      "single": "Els termes del núvol són \"features\" detectades en els textos analitzats. La mida indica freqüència relativa de detecció.",
      "compare": "A cada núvol, els termes són \"features\" detectades en els textos analitzats. Si un terme apareix als dos núvols, manté el mateix color per facilitar la comparació.",
      "default": "Els \"features\" són termes detectats automàticament a partir dels textos analitzats."
    },
    "coverage_programme": "Per a l'ensenyament, s'ha calculat la cobertura per a totes les combinacions de sistema i secció. Amb \"{system_label}\" i \"{section_label}\": {with_sdg} de {total_courses} assignatures ({coverage_pct}%).",
    "coverage_centre_unavailable": "Per calcular aquest percentatge per sistema i secció cal seleccionar un ensenyament (vista per assignatura).",
    "coverage_unavailable": "No s'ha pogut calcular el percentatge d'assignatures amb ODS reconeguts per a aquesta selecció."
  }
}
